TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x1_cc26x1/inc/hw_ccfg.h
// Field:     [1] DIS_ALT_DCDC_SETTING
//
// Disable alternate DC/DC settings.
// 0: Enable alternate DC/DC settings.
// 1: Disable alternate DC/DC settings.
// See:
// MODE_CONF_1.ALT_DCDC_VMIN
// MODE_CONF_1.ALT_DCDC_DITHER_EN
// MODE_CONF_1.ALT_DCDC_IPEAK
//
// NOTE! The DriverLib function SysCtrl_DCDC_VoltageConditionalControl() must
// be called regularly to apply this field (handled automatically if using TI
// RTOS!).
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_ALT_DCDC_SETTING                0x00000002
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_ALT_DCDC_SETTING_BITN                    1
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_ALT_DCDC_SETTING_M              0x00000002
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_ALT_DCDC_SETTING_S                       1

// Field:     [0] DIS_XOSC_OVR
//
// Disable XOSC override functionality.
// 0: Enable XOSC override functionality.
// 1: Disable XOSC override functionality.
// See:
// MODE_CONF_1.DELTA_IBIAS_INIT
// MODE_CONF_1.DELTA_IBIAS_OFFSET
// MODE_CONF_1.XOSC_MAX_START
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_XOSC_OVR                        0x00000001
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_XOSC_OVR_BITN                            0
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_XOSC_OVR_M                      0x00000001
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_XOSC_OVR_S                               0

//*****************************************************************************
//
// Register: CCFG_O_MODE_CONF
//
//*****************************************************************************
// Field: [31:28] VDDR_TRIM_SLEEP_DELTA
//
// Signed delta value to apply to the
// VDDR_TRIM_SLEEP target, minus one. See FCFG1:VOLT_TRIM.VDDR_TRIM_SLEEP_H.
// 0x8 (-8) : Delta = -7
// ...
// 0xF (-1) : Delta = 0
// 0x0 (0) : Delta = +1
// ...
// 0x7 (7) : Delta = +8
#define CCFG_MODE_CONF_VDDR_TRIM_SLEEP_DELTA_W                               4
#define CCFG_MODE_CONF_VDDR_TRIM_SLEEP_DELTA_M                      0xF0000000
#define CCFG_MODE_CONF_VDDR_TRIM_SLEEP_DELTA_S                              28

// Field:    [27] DCDC_RECHARGE
//
// DC/DC during recharge in powerdown.
// 0: Use the DC/DC during recharge in powerdown.
// 1: Do not use the DC/DC during recharge in powerdown (default).
//
// NOTE! The DriverLib function SysCtrl_DCDC_VoltageConditionalControl() must
// be called regularly to apply this field (handled automatically if using TI
// RTOS!).
#define CCFG_MODE_CONF_DCDC_RECHARGE                                0x08000000
#define CCFG_MODE_CONF_DCDC_RECHARGE_BITN                                   27
#define CCFG_MODE_CONF_DCDC_RECHARGE_M                              0x08000000
#define CCFG_MODE_CONF_DCDC_RECHARGE_S                                      27

// Field:    [26] DCDC_ACTIVE
//
// DC/DC in active mode.
// 0: Use the DC/DC during active mode.
// 1: Do not use the DC/DC during active mode (default).
//
// NOTE! The DriverLib function SysCtrl_DCDC_VoltageConditionalControl() must
// be called regularly to apply this field (handled automatically if using TI
// RTOS!).
#define CCFG_MODE_CONF_DCDC_ACTIVE                                  0x04000000
#define CCFG_MODE_CONF_DCDC_ACTIVE_BITN                                     26
#define CCFG_MODE_CONF_DCDC_ACTIVE_M                                0x04000000
#define CCFG_MODE_CONF_DCDC_ACTIVE_S                                        26

// Field:    [25] VDDR_EXT_LOAD
//
// Reserved for future use. Software should not rely on the value of a
// reserved. Writing any other value than the reset/default value may result in
// undefined behavior.
#define CCFG_MODE_CONF_VDDR_EXT_LOAD                                0x02000000
#define CCFG_MODE_CONF_VDDR_EXT_LOAD_BITN                                   25
#define CCFG_MODE_CONF_VDDR_EXT_LOAD_M                              0x02000000
#define CCFG_MODE_CONF_VDDR_EXT_LOAD_S                                      25

// Field:    [24] VDDS_BOD_LEVEL
//
// VDDS BOD level.
// 0: VDDS BOD level is 2.0V (necessary for external load mode, or for maximum
// PA output power on CC13xx).
// 1: VDDS BOD level is 1.8V (or 1.65V for external regulator mode) (default).
#define CCFG_MODE_CONF_VDDS_BOD_LEVEL                               0x01000000
#define CCFG_MODE_CONF_VDDS_BOD_LEVEL_BITN                                  24
#define CCFG_MODE_CONF_VDDS_BOD_LEVEL_M                             0x01000000
#define CCFG_MODE_CONF_VDDS_BOD_LEVEL_S                                     24

// Field: [23:22] SCLK_LF_OPTION
//
// Select source for SCLK_LF.
// ENUMs:
// RCOSC_LF                 Low frequency RCOSC (default)
// XOSC_LF                  32.768 kHz low frequency XOSC
// EXTERNAL_LF              External low frequency clock on DIO defined by
//                          EXT_LF_CLK.DIO. The RTC tick speed
//                          AON_RTC:SUBSECINC is updated to
//                          EXT_LF_CLK.RTC_INCREMENT (done in the
//                          SetupTrimDevice() driverlib boot function).
//                          External clock must always be running when the
//                          chip is in standby for VDDR recharge timing.
// XOSC_HF_DLF              31.25 kHz clock derived from 48 MHz XOSC or HPOSC.
//                          The RTC tick speed AON_RTC:SUBSECINC is updated
//                          to 0x8637BD, corresponding to a 31.25 kHz clock
//                          (done in the SetupTrimDevice() driverlib boot
//                          function). The device must be blocked from
//                          entering Standby mode when using this clock
//                          source.
#define CCFG_MODE_CONF_SCLK_LF_OPTION_W                                      2
#define CCFG_MODE_CONF_SCLK_LF_OPTION_M                             0x00C00000
#define CCFG_MODE_CONF_SCLK_LF_OPTION_S                                     22
#define CCFG_MODE_CONF_SCLK_LF_OPTION_RCOSC_LF                      0x00C00000
#define CCFG_MODE_CONF_SCLK_LF_OPTION_XOSC_LF                       0x00800000
#define CCFG_MODE_CONF_SCLK_LF_OPTION_EXTERNAL_LF                   0x00400000
#define CCFG_MODE_CONF_SCLK_LF_OPTION_XOSC_HF_DLF                   0x00000000

// Field:    [21] VDDR_TRIM_SLEEP_TC
//
// 0x1: VDDR_TRIM_SLEEP_DELTA is not temperature compensated
// 0x0: RTOS/driver temperature compensates VDDR_TRIM_SLEEP_DELTA every time
// standby mode is entered. This improves low-temperature RCOSC_LF frequency
// stability in standby mode.
//
// When temperature compensation is performed, the delta is calculates this
// way:
// Delta = max (delta, min(8, floor(62-temp)/8))
// Here, delta is given by VDDR_TRIM_SLEEP_DELTA, and temp is the current
// temperature in degrees C.
#define CCFG_MODE_CONF_VDDR_TRIM_SLEEP_TC                           0x00200000
#define CCFG_MODE_CONF_VDDR_TRIM_SLEEP_TC_BITN                              21
#define CCFG_MODE_CONF_VDDR_TRIM_SLEEP_TC_M                         0x00200000
#define CCFG_MODE_CONF_VDDR_TRIM_SLEEP_TC_S                                 21

// Field:    [20] RTC_COMP
//
// Reserved for future use. Software should not rely on the value of a
// reserved. Writing any other value than the reset/default value may result in
// undefined behavior.
#define CCFG_MODE_CONF_RTC_COMP                                     0x00100000
#define CCFG_MODE_CONF_RTC_COMP_BITN                                        20
#define CCFG_MODE_CONF_RTC_COMP_M                                   0x00100000
#define CCFG_MODE_CONF_RTC_COMP_S                                           20

