TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x1_cc26x1/inc/hw_ccfg.h
// Field:     [9] WRT_PROT_SEC_9
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_9                          0x00000200
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_9_BITN                              9
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_9_M                        0x00000200
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_9_S                                 9

// Field:     [8] WRT_PROT_SEC_8
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_8                          0x00000100
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_8_BITN                              8
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_8_M                        0x00000100
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_8_S                                 8

// Field:     [7] WRT_PROT_SEC_7
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_7                          0x00000080
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_7_BITN                              7
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_7_M                        0x00000080
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_7_S                                 7

// Field:     [6] WRT_PROT_SEC_6
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_6                          0x00000040
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_6_BITN                              6
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_6_M                        0x00000040
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_6_S                                 6

// Field:     [5] WRT_PROT_SEC_5
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_5                          0x00000020
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_5_BITN                              5
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_5_M                        0x00000020
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_5_S                                 5

// Field:     [4] WRT_PROT_SEC_4
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_4                          0x00000010
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_4_BITN                              4
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_4_M                        0x00000010
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_4_S                                 4

// Field:     [3] WRT_PROT_SEC_3
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_3                          0x00000008
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_3_BITN                              3
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_3_M                        0x00000008
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_3_S                                 3

// Field:     [2] WRT_PROT_SEC_2
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_2                          0x00000004
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_2_BITN                              2
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_2_M                        0x00000004
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_2_S                                 2

// Field:     [1] WRT_PROT_SEC_1
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_1                          0x00000002
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_1_BITN                              1
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_1_M                        0x00000002
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_1_S                                 1

// Field:     [0] WRT_PROT_SEC_0
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_0                          0x00000001
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_0_BITN                              0
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_0_M                        0x00000001
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_0_S                                 0

//*****************************************************************************
//
// Register: CCFG_O_CCFG_PROT_63_32
//
//*****************************************************************************
// Field:    [31] WRT_PROT_SEC_63
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_63                        0x80000000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_63_BITN                           31
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_63_M                      0x80000000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_63_S                              31

// Field:    [30] WRT_PROT_SEC_62
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_62                        0x40000000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_62_BITN                           30
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_62_M                      0x40000000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_62_S                              30

// Field:    [29] WRT_PROT_SEC_61
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_61                        0x20000000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_61_BITN                           29
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_61_M                      0x20000000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_61_S                              29

// Field:    [28] WRT_PROT_SEC_60
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_60                        0x10000000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_60_BITN                           28
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_60_M                      0x10000000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_60_S                              28

// Field:    [27] WRT_PROT_SEC_59
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_59                        0x08000000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_59_BITN                           27
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_59_M                      0x08000000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_59_S                              27

// Field:    [26] WRT_PROT_SEC_58
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_58                        0x04000000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_58_BITN                           26
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_58_M                      0x04000000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_58_S                              26

